// let arr = [3, 4, 6, 12, 3, 5]

// for (let i = 0; i < arr.length; i++) {
//     if (arr[i] > 3 && arr[i] <  10) {
//         console.log(arr[i]);
//     }undefined
// }


// let mearr = [10, 20, 30, 125, 2000,]

// let youarr = [1, 2, 3, 4, 5, 6, 7, 8, 9,]

// for (let i = 0; i > youarr.length; i++) {
//     youarr.push(i);  {
//         console.log(youarr);
//     }
// }





// var prt = prompt("write");
// if (prt !== 1) {
//     alert("напишите символ")
// } else {
//     var rct = "";

//     for (let i = 0;i > 7; i++) {
//         for (let j = 0;j < 21; j++){
            
//             rct += prt;
//         }
//         rct += "\n"
//     }
//     prt(i) +< rct.length   {

//         console.log();
//     }
// }
// console.log(rct[i])


// let mearr = "$"
//     for (let i = 0;i < arr; i++) 
//     for (let j = 0;j > mearr; j++)

// function getRandom(min, max) {
//     return Math.floor(Math.random() * (max - min) + min);
// }

// // let prt = prompt("num 3") 


// // let mearr = [10, 20, 30, 125, 2000,]

// console.log(getRandom(4,0))
// console.log(getRandom(4,0))
// console.log(getRandom(4,0 ))


// const arr = prompt("max 8")

// let miarr = ""

// for (let i = 0;i < miarr.length; i++) {
//     if (arr >= 8) {
//         console.log(arr[i]);
//     } else (arr[i] <=10); {
//         console.log(miarr[i]);
//     }
       
// }





// const getime0fcookedegg = (eggs) => Math.ceil(eggs / 8) * 5;

// console.log(getime0fcookedegg(prompt()));
let str = 'Nevis ITDB TECH';
console.log(str.split(" ")[0].length);




// Вам дана переменная str = 'Nevis ITDB TECH'.
// Выведите в консоль длину первого слова.


// Вам дана переменная str = 'Максимально УЖАСНО'.
// Выведите в консоль слово УЖАСНО, только нижним регистром.


// 3. Вам дана переменная str ='Максимально УЖАСНО'.
// Выведите в консоль слово максимально, только верхним регистром.



// 4. Вам дана переменная str = 'Максимально Ужасно'.
// Выведите в консоль каждый символ этой строки, используя метод split.
// Пример : [ 'C','o','d','i','n','g',' ','i','s',' ','t','h','e',' ', 'L','O','V','E',' ','o','f',' ','m','y',' ','L','I','F','E','!' ]



// 5. Вам дана переменная str = 'Максимально Ужасно, переделывай'.
// Выведите в консоль все
// слова этой строки, используя метод split. Пример:
// [ 'Максимально', 'ужасно', 'переделывай' ]


// 7. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль букву У,
// использую метод charAt.



// 8. Вам даны переменные str = 'Максимально', str2 = 'Ужасно'. Выведите в
// консоль соединенные строки, используя метод concat.


// 9. Вам дана переменная str = 'Максимально Ужасно'. Выведите
// в консоль индекс слова 'Ужасно'.



// 10. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль
// "встречается более 1 раза", если букв 'a' встречается более 1 раза, иначе "встречается менее одного раза"


// 11. Вам дана переменная str = 'макСИМАЛЬНО ужаСНО'. Выведите в
// консоль первую букву каждого слова строки в верхний регистр.



// 12. Вам дана переменная str = 'Максимально Ужасно'. Выведите в консоль
// индекс первого вхождения буквы а.



// 13. Вам дана переменная str = 'Максимально Ужасно'. Выведите в
// консоль индекс первого последнего буквы о.


// 14. Вам дана переменная str = 'aaa bbb ccc'. Вырежите из нее слово 'bbb' тремя
// разными способами (через substr, substring, slice) и выведите в консоль.


// 15. Вам дана переменная str = '17-02-2021'. Преобразуйте эту дату
// в формат '31/12/2025' и выведите в консоль.


// 16. Вам дана переменная str = 'Максимально Ужасно'. Проверьте, есть ли буква "в"
// в данной строке, если да, то выведите "Да", иначе - "нет".



// 17. Вам дана переменная str = 'АаааааА'. Проверьте, если первая
// буква в строке совпадает с
// последней, если да, то выведите в консоль "Совпадает", иначе - "Не совпадает".


// 18. Вам дана переменная str = 'Максимально'. Проверьте, если буква л, встречается в
// первой половине строки, или последней. Если в первой, то выведите в консоль -
// "В первой половине", иначе - "Во второй половине".


// -----------------------------------LEVEL 2 ---------------------------\\


// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.


// 2. Вам даны две переменные a=50, b=100. Составьте условие, по которому в консоль будет выводиться
// 'a больше b', 'a меньше b'.

// 3. Вам дана переменная a=-2. Составьте условие, по которому в консоль будет выводиться 'positive'
// - если число больше 0, 'равно' если число равно 0, "negative" если число меньше 0.


// 4. Вам дана переменная number=45. Составьте условие, по которому будет выводиться в
// консоль "Четное число", "Нечетное число".


// 5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления a на b, будет выводиться
// консоль "Четное число", "Нечетное число".


// 6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится тип этой переменной
// - "boolean", "number", "string".


// 7. Вам дана переменная а. Если переменная a больше одного и меньше 9-ти, то выведите 'Верно', иначе выведите
// 'Неверно'.


// 8. Вам дана переменная а. Если переменная a равна трем или равна семи, то прибавьте к ней 7,
// иначе поделите ее на 10. Выведите новое значение переменной в консоль